Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Write data to the file using the handle returned by FileOpen.
fr: Écrit des données dans le fichier à l'aide du handle retourné par FileOpen.

source: Flush the file to disk.
fr: Vide le fichier sur le disque.

source: Check file position and try to read contents for current position.
fr: Vérifie la position du fichier et essaie de lire le contenu à la position courante.

source: Now, adjust the position to the beginning.
fr: Maintenant, ajuste la position sur le début.

source: The path to the file or directory to check.
fr: Nom de fichier (ou répertoire) à vérifier.

source: a code string representing a file's attributes.
fr: Retourne une chaîne de code représentant les attributs d'un fichier.

source: String() returned could contain a combination of these letters "RASHNDOCT":
fr: La chaîne de code retournée peut contenir une combinaison de ces lettres "RASHNDOCT":

source: "R" = READONLY
fr: "R" = READONLY (Lecture seule)

source: "A" = ARCHIVE
fr: "A" = ARCHIVE (Archive)

source: "S" = SYSTEM
fr: "S" = SYSTEME (Système)

source: "H" = HIDDEN
fr: "H" = HIDDEN (Caché)

source: "N" = NORMAL
fr: "N" = NORMAL (Normal)

source: "D" = DIRECTORY
fr: "D" = DIRECTORY (Répertoire)

source: "O" = OFFLINE
fr: "O" = OFFLINE (Hors ligne)

source: "C" = COMPRESSED (NTFS compression, not ZIP compression)
fr: "C" = COMPRESSED (compression NTFS, pas ZIP)

source: "T" = TEMPORARY
fr: "T" = TEMPORARY (Temporaire)

source: Create a constant variable in Local scope to store the file attributes of the current script.
fr: Crée une constante de portée locale pour stocker les attributs de fichier du script en cours.

source: Display the string returned by FileGetAttrib.
fr: Affiche la chaîne renvoyée par FileGetAttrib.

source: Display the string returned by AttributeToString
fr: Affiche la chaîne renvoyée par AttributeToString

source: Create a 1d array of the file attribute letters by splitting the string at the comma (,).
fr: Crée un tableau 1D avec des lettres d'attribut de fichier en divisant la chaîne à la virgule (,).

source: Create a 1d array using the friendlier file attribute names by splitting the string at the comma (,).
fr: Crée un tableau 1D en utilisant les noms des attributs de fichier plus respectueux en divisant la chaîne à la virgule (,).

source: Loop through the attribute letters array to replace with the friendlier value e.g.A becomes Archive or S becomes System.
fr: Boucle à travers le réseau des lettres d'attribut à remplacer par la valeur conviviale par exemple A devient Archive ou S devient système.

source: Remove the single space and trailing forward slash.
fr: Supprime l'espace unique et barre oblique de fin.

source: Return the attribute string.
fr: Retourne une chaîne d'attribut.

source: Assign a variable with the filepath to check on whether it's a file or not.
fr: Assigne une variable avec le chemin du fichier pour vérifier si c'est un fichier ou non.

source: Check if the filepath is a file.
fr: Vérifiez si le chemin du fichier est un fichier.

source: Does not validate if the file exists.
fr: Ne pas vérifier si le fichier existe.

source: Assign a variable with the filepath to check on whether it's a directory/folder or not.
fr: Assigne une variable avec le chemin du fichier pour vérifier si c'est un répertoire / dossier ou pas.

source: Check if the filepath is a directory/folder.
fr: Vérifiez si le chemin du fichier est un répertoire / dossier.

source: Does not validate if the directory/folder exists.
fr: Ne pas valider si le répertoire / dossier existe.

source: Alternatively you may use a string filename as the first parameter.
fr: Sinon, vous pouvez utiliser le chemin d'accès d'un fichier comme premier paramètre.

source: The UTF8 detection mode to use.
fr: Le mode de détection UTF8 à utiliser.

source: 1 = Check entire file for UTF8 sequences (default)
fr: 1 = Vérifie la totalité du fichier pour des séquences UTF8 (par défaut)

source: 2 = Check first part of file for UTF8 sequences (the same as FileOpen() uses by default)
fr: 2 = Vérifie la première partie du fichier pour des séquences UTF8 (identique à la vérification par défaut de FileOpen())

source: the file encoding using similar values to the FileOpen() function:
fr: Retourne l'encodage du fichier en utilisant des valeurs similaires à la fonction FileOpen():

source: 128 = UTF8 (with BOM).
fr: 128 = UTF8 (avec BOM).

source: 256 = (without BOM).
fr: 256 = (sans BOM).

source: If a filename is given rather than a file handle - the file will be opened and closed during the function call.
fr: Si un fichier est donné plutôt qu'un handle, le fichier sera ouvert puis fermé durant l'appel de fonction.

source: Do not mix filehandles and filenames, i.e., don't FileOpen() a file and then use a filename in this function.
fr: Ne mélangez pas les handles de fichier et les noms de fichiers, par exemple, n'utilisez pas FileOpen() pour ensuite utiliser le nom du fichier dans cette fonction.

source: Use either filehandles or filenames in your routines, not both!
fr: Utilisez les handles ou les noms de fichiers dans votre routine, mais pas les deux.

source: If a file handle is used then the "mode" parameter has no effect - the mode used for FileOpen() takes precedence.
fr: Si un handle de fichier est utilisé alors le paramètre "mode" n'a aucun effet - Le mode utilisé pour FileOpen() a la priorité.

source: Retrieve the file encoding of the current script.
fr: Récupére l'encodage du fichier du script courant.

source: The value returned for this example should be 0 or ANSI.
fr: La valeur renvoyée pour cet exemple doit être de 0 ou ANSI.

source: Full path and file name to convert
fr: Le chemin complet et nom du fichier à convertir

source: if 1 file can have relative dir, e.g."..\file.txt"
fr: Si Flag = 1, le fichier peut avoir un répertoire relatif, par exemple "..\ fichier.txt"

source: the long path+name of the path+name passed.
fr: Retourne le chemin + nom long du chemin + nom donné.

source: the parameter and sets the @error flag to 1.
fr: Retourne le paramètre et @error = 1.

source: Create a constant variable in Local scope of the filepath to retrieve the longname of.
fr: Créez une constante de portée locale du chemin du fichier dont on veut le nom long.

source: Generally this is the same as @ProgramFilesDir.
fr: En général, cela est le même que ProgramFilesDir.

source: Display the long path+name of the program files directory.
fr: Affiche le chemin+nom long du répertoire des fichiers programme.

source: the position offset from the beginning of the file (First index is 0).
fr: Retourne la position de l'offset par rapport au début du fichier (Le premier index est 0).

source: Failure returns 0 but 0 is also a valid file position so check @error to determine error conditions.
fr: Un échec retourne 0, mais 0 est également une position valide dans le fichier, alors vérifiez @error pour déterminer la condition d'erreur.

source: an array that contains the shortcut information.
fr: Retourne un tableau qui contient les informations du raccourci.

source: sets the @error flag to 1 if the shortcut could not be accessed.
fr: Retourne @error = 1 si le raccourci n'est pas accessible.

source: The array returned from this function is a single dimension array containing the following elements:
fr: Le tableau retourné par cette fonction est un tableau à une dimension contenant les éléments suivants:

source: $aArray[0] = Shortcut target path
fr: $array[0] = Chemin cible de raccourci

source: $aArray[1] = Working directory
fr: $array[1] = Répertoire de travail

source: $aArray[2] = Arguments
fr: $array[2] = Arguments

source: $aArray[3] = Description
fr: $array[3] = Description

source: $aArray[4] = Icon filename
fr: $array[4] = Nom du fichier pour l'icône

source: $aArray[5] = Icon index
fr: $array[5] = Index de l'icône

source: $aArray[6] = The shortcut state (@SW_SHOWNORMAL, @SW_SHOWMINNOACTIVE, @SW_SHOWMAXIMIZED)
fr: $array[6] = L'état du raccourcis (@SW_SHOWNORMAL, @SW_SHOWMINNOACTIVE, @SW_SHOWMAXIMIZED)

source: full path and file name to convert
fr: Le chemin complet et nom du fichier à convertir

source: the 8.3 short path+name of the path+name passed.
fr: Retourne le chemin + nom au format court 8.3 du chemin + nom donné.

source: The file needs to exist as there is no way to know the exact ~i if several file have the same 8 first characters.
fr: Le fichier doit exister car il n'y a aucun moyen de connaître le ~i exacte si plusieurs fichiers ont les 8 premiers caractères identiques.

source: Create a constant variable in Local scope of the filepath to retrieve the shortname of.
fr: Crée une constante de portée locale avec le chemin du fichier dont on veut récupérer le nom court.

source: Display the short path+name of the program files directory.
fr: Affiche le chemin+nom court du répertoire des fichiers programme.

source: Filename to check.
fr: Nom du fichier à vérifier.

source: the size of the file in bytes.
fr: Retourne la taille du fichier en octets.

source: Does not work on directories.
fr: Ne fonctionne pas sur les répertoires.

source: Divide result by 1024 to get kilobyte equivalent, or divide by 1048576 to get megabyte equivalent.
fr: Diviser le résultat par 1024 pour obtenir l'équivalent en kilooctet, ou diviser par 1048576 pour obtenir l'équivalent en mégaoctet.

source: Retrieve the file size (in bytes) of the AutoIt executable.
fr: Récupére la taille du fichier (en octets) de l'exécutable AutoIt.

source: Display the file size and convert to a readable form.
fr: Affiche la taille du fichier et la convertit dans une forme lisible.

source: Flag to indicate which timestamp
fr: Paramètre du timestamp (horodatage)

source: $FT_MODIFIED (0) = Last modified (default)
fr: $FT_MODIFIED (0) = Date de dernière modification (défaut)

source: $FT_CREATED (1) = Created
fr: $FT_CREATED (1) = Date de réation

source: $FT_ACCESSED (2) = Last accessed
fr: $FT_ACCESSED (2) = Date du dernier accès

source: to specify type of return
fr: pour spécifier le type de retour

source: 0 = return an array (default)
fr: 0 = Retourne un tableau (par défaut)

source: 1 = return a string YYYYMMDDHHMMSS
fr: 1 = Retourne une chaîne AAAAMMJJHHMMSS

source: an array or string that contains the file time information.
fr: Retourne un tableau ou une chaîne qui contient les informations de temps du fichier.

source: The array is a single dimension array containing six elements:
fr: Le tableau est un tableau à une dimension contenant six éléments:

source: $aArray[0] = year (four digits)
fr: $array[0] = année (quatre chiffres)

source: $aArray[1] = month (range 01 - 12)
fr: $array[1] = mois (de 01 à 12)

source: $aArray[2] = day (range 01 - 31)
fr: $array[2] = jour (de 01 à 31)

source: $aArray[3] = hour (range 00 - 23)
fr: $array[3] = heure (de 00 à 23)

source: $aArray[4] = min (range 00 - 59)
fr: $array[4] = min (de 00 à 59)

source: $aArray[5] = sec (range 00 - 59)
fr: $array[5] = sec (de 00 à 59)

source: Notice that return values are zero-padded.
fr: Notez que les valeurs de retour sont complétées avec des zéros.

source: Set the modified timestamp of the file to 1st Nov 2003 and use the current time.
fr: Définit la date de modification du fichier au 1 novembre 2003 et utilise l'heure actuelle.

source: Display the modified timestamp of the file and return as a string in the format YYYYMMDDHHMMSS.
fr: Affiche la date de modification du fichier et retourne une chaîne au format AAAAMMJJHHMMSS.

source: name of the field to be retrieved from the header version file info (see Remarks).
fr: Nom du champ à récupérer dans l'en-tête d'information de version du fichier.

source: a string containing the version information, e.g.
fr: Retourne une chaîne contenant les informations de version, par exemple:

source: "0.0.0.0" if no version information (or other error) or "" when retrieving a stringname, and sets the @error flag to 1.
fr: Retourne "0.0.0.0" si aucune information de version (ou autre erreur) ou "" lors de la récupération d'un nom de chaîne , et met @error à 1.

source: The parameter stringname can be one of the following:
fr: Le nom de chaîne peut être simplement:

source: Another special stringname is "DefaultLangCodepage" can be used to retrieve the default language and codepage.
fr: Un autre nom de chaîne spécial est "DefaultLangCodepage" qui peut être utilisé pour retourner la langue et les pages de code.

source: The language and codepage can be used if needed to differentiate the "stringname" i.e.
fr: La langue et les pages de code peuvent être utilisés si nécessaire pour différencier les "stringname" (noms de chaîne) exemple :

source: "080904b0\Comments" (see MSDN StringFileInfo in VerQueryValue function).
fr: "080904b0\Comments" (Consultez StringFileInfo dans la fonction VerQueryValue sur MSDN).

source: To get the version number of an AutoIt compiled script it is better to use the @AutoItVersion macro.
fr: Pour obtenir le numéro de version d'un script Autoit compilé il est mieux d'utiliser la macro @AutoItVersion.

source: Retrieve the file version of the AutoIt executable.
fr: Récupére la version du fichier de l'exécutable AutoIt.

source: Display the file version.
fr: Affiche la version du fichier.

source: This should be equal to @AutoItVersion.
fr: Elle devrait être égale à @AutoItVersion.

source: The source path and filename of the file to move.
fr: Chemin du/des fichier(s) à déplacer.

source: (* wildcards accepted - See Remarks)
fr: (Les Wildcards * sont pris en charge)

source: The destination path and filename of the moved file.
fr: Chemin et nom du répertoire de destination du/des fichier(s) déplacer.

source: 0 if source cannot be moved or if dest already exists and flag=0.
fr: Retourne 0 si source ne peut pas être déplacé ou si dest existe déjà et flag=0.

source: If the source and destination paths are on different volumes a copy and delete operation is performed rather than a move.
fr: Si la source et les chemins de destination sont sur des volumes différents une copie puis une suppression est effectuée au lieu d'un déplacement.

source: Because AutoIt lacks a "FileRename" function, use FileMove() to rename a file!
fr: Parce que AutoIt ne possède pas de fonction "FileRename", utiliser FileMove() pour renommer un fichier!

source: For instance the combined flag $FC_OVERWRITE (1) + $FC_CREATEPATH (8) overwrites the target file and prechecks for the destination directory structure and if it doesn't exist creates it automatically.
fr: Par exemple le paramètre combiné $FC_OVERWRITE (1) + $FC_CREATEPATH (8), écrase le fichier cible et vérifie la structure du répertoire de destination et si elle n'existe pas, il la crée automatiquement.

source: Create a temporary file to move.
fr: Crée un fichier temporaire qui sera déplacé.

source: Move Au3 files in the temporary directory to a new folder/directory called Au3Files.
fr: Déplace les fichiers Au3 du répertoire temporaire vers un nouveau dossier/répertoire appelé Au3Files.

source: Create a constant variable in Local scope of the filepaths that will be renamed.
fr: Crée une constante de portée locale avec des chemins de fichiers qui seront renommés.

source: Create a temporary file to rename.
fr: Crée un fichier temporaire qui sera renommé.

source: Rename a file using FileMove and overwrite the new file if it exists.
fr: Renomme un fichier en utilisant FileMove et remplace le nouveau fichier s'il existe.

source: Display results that the destination file was renamed.
fr: Affiche les résultats pour montrer que le fichier de destination a été renommé.

source: FileExists should return 0.
fr: FileExists doivent toujours retourner 0.

source: FileExists should return 1.
fr: FileExists devraient revenir 1.

source: FileDelete checks if the file exists.
fr: FileDelete vérifie si le fichier existe.

source: Filename of the file to open.
fr: Nom du fichier texte à ouvrir.

source: Mode to open the file in.
fr: Mode d'ouverture du fichier.

source: $FO_READ (0) = Read mode (default)
fr: $FO_READ (0) = Mode lecture (par défaut)

source: $FO_APPEND (1) = Write mode (append to end of file)
fr: $FO_APPEND (1) = Mode écriture (ajoute à la fin du fichier)

source: $FO_OVERWRITE (2) = Write mode (erase previous contents)
fr: $FO_OVERWRITE (2) = Mode écriture (efface le contenu précédent)

source: $FO_CREATEPATH (8) = Create directory structure if it doesn't exist (See Remarks).
fr: $FO_CREATEPATH (8) = Crée la structure des répertoires si elle n'existe pas (Voir Remarques).

source: $FO_BINARY (16) = Force binary mode (See Remarks).
fr: $FO_BINARY (16) = Force le mode binaire (Consultezles remarques).

source: $FO_UNICODE or $FO_UTF16_LE (32) = Use Unicode UTF16 Little Endian reading and writing mode.
fr: $FO_UNICODE or $FO_UTF16_LE (32) = Utilise l'Unicode UTF16 Little Endian en mode lecture et écriture.

source: Reading does not override existing BOM.
fr: La lecture ne remplace pas la marque d'ordre des octets (BOM) existante.

source: $FO_UTF16_BE (64) = Use Unicode UTF16 Big Endian reading and writing mode.
fr: 64 = Utilise l'Unicode UTF16 Big Endian en mode lecture et écriture.

source: $FO_UTF8 (128) = Use Unicode UTF8 (with BOM) reading and writing mode.
fr: $FO_UTF8 (128) = Utilise l'Unicode UTF8 (avec BOM).

source: $FO_UTF8_NOBOM (256) = Use Unicode UTF8 (without BOM) reading and writing mode.
fr: $FO_UTF8_NOBOM (256) = Utilise l'Unicode UTF8 (sans BOM) en lecture et écriture.

source: $FO_UTF8_FULL (16384) = When opening for reading and no BOM is present, use full file UTF8 detection.
fr: $FO_UTF8_FULL (16384) = Lors de l'ouverture en lecture et sans BOM, utilise la détection UTF8 sur le fichier complet.

source: If this is not used then only the initial part of the file is checked for UTF8.
fr: Si ce n'est pas utilisé, alors seulement la partie initiale du fichier est vérifiée pour l'UTF8.

source: The folder path must already exist (except using $FO_CREATEPATH mode - See Remarks).
fr: Le chemin du dossier doit déjà exister (sauf en utilisant le mode '8' - Voir Remarque).

source: a file "handle" for use with subsequent file functions.
fr: Retourne un handle de fichier pour utilisation ultérieure avec les fonctions de fichier.

source: The file handle must be closed with the FileClose() function.
fr: Le "handle" de fichier doit être fermé avec la fonction FileClose().

source: A file may fail to open due to access rights or attributes.
fr: Un fichier peut ne pas s'ouvrir en raison de droits d'accès ou d'attributs.

source: The default mode when writing text is ANSI - use the unicode flags to change this.
fr: Le mode par défaut lors de l'écriture de texte est ANSI - Utilisez le mode Unicode pour changer cela.

source: When writing unicode files the Windows default mode (and the fastest in AutoIt due to the least conversion) is UTF16 Little Endian (mode 32).
fr: Lors de l'écriture des fichiers, le mode Unicode par défaut de Windows (et le plus rapide dans AutoIt en raison de la conversion simple) est UTF16 Little Endian (mode 32).

source: Opening a file in write mode creates the file if it does not exist.
fr: L'ouverture d'un fichier en mode écriture crée le fichier s'il n'existe pas.

source: Directories are not created unless the correct flag is used.
fr: Les répertoires ne sont pas créés à moins d'utiliser le bon mode.

source: When reading and writing via the same file handle, the FileSetPos() function must be used to update the current file position.
fr: Lors de la lecture et l'écriture par le même "handle" de fichier, la fonction FileSetPos() doit être utilisée pour mettre à jour la position courante dans le fichier.

source: A file can be read as binary (byte) data by using FileOpen() with the binary flag.
fr: Un fichier peut être lu comme données binaires (byte) en utilisant FileOpen() avec le flag binaire.

source: Open the file for read/write access.
fr: Ouvre le fichier pour un accès en lecture/écriture.

source: Write some data.
fr: Écrit quelques données.

source: Retrieve the current position in the file.
fr: Récupére la position actuelle dans le fichier.

source: Now, adjust the position back to the previous position.
fr: Maintenant, ajuste la position sur la position précédente.

source: Write some addition data.
fr: Écrit quelques données en plus.

source: Adjust the position back to the previous position.
fr: Ajuste la position sur la position précédente.

source: Title text of the Dialog GUI.
fr: Texte du titre de la boite de dialogue.

source: Initial directory selected in the GUI file tree.
fr: Répertoire initial proposé à l'utilisateur.

source: File type single filter such as "All (*.*)" or "Text files (*.txt)" or multiple filter groups such as "All (*.*)|Text files (*.txt)" (See Remarks).
fr: Filtre unique du type de fichier tel que "Tous les fichiers (*.*)" ou "Fichiers texte (*.txt)" ou groupes de filtres multiples tels que "Tous les fichiers (*.*)|Fichiers texte (*.txt)" (Voir Remarques).

source: Dialog Options:
fr: Options du dialogue:

source: To use more than one option, BitOR the required values together.
fr: Pour utiliser plus d'une option, additionnez les valeurs requises ensemble.

source: $FD_FILEMUSTEXIST (1) = File Must Exist (if user types a filename)
fr: $FD_FILEMUSTEXIST (1) = Le fichier doit exister (si l'utilisateur tape un nom de fichier)

source: $FD_PATHMUSTEXIST (2) = Path Must Exist (if user types a path, ending with a backslash)
fr: $FD_PATHMUSTEXIST (2) = Le chemin doit exister (si l'utilisateur tape un chemin, se terminant par un antislash)

source: $FD_MULTISELECT (4) = Allow MultiSelect
fr: $FD_MULTISELECT (4) = Permettre la sélection multiple

source: $FD_PROMPTCREATENEW (8) = Prompt to Create New File (if does not exist)
fr: $FD_PROMPTCREATENEW (8) = Demande la création d'un nouveau fichier (s'il n'existe pas)

source: Suggested file name for the user to open.
fr: Nom de fichier suggéré à l'ouverture.

source: Default is blank ("").
fr: Vide par défaut ("").

source: The window handle to use as the parent for this dialog.
fr: Le handle de fenêtre à utiliser comme parent pour cette boîte de dialogue.

source: the full path of the file(s) chosen.
fr: Retourne le chemin complet du(des) fichier(s) choisi.

source: Results for multiple selections are "Directory|file1|file2|...".
fr: Les résultats pour les sélections multiples sont "Répertoire|fichier1|fichier2|..."

source: 1 = File selection failed.
fr: 1 - La sélection de fichier a échoué.

source: 2 = Bad file filter
fr: 2 - Filtre de fichier incorrect

source: Separate the file filters with a semicolon as shown in the example.
fr: Séparez les filtres de fichiers avec une point-virgule comme montré dans l'exemple.

source: Multiple groups of filters are separated by a pipe "|".
fr: Plusieurs groupes de filtres sont séparés par une barre verticale "|".

source: If default name is given, options must also be given.
fr: Si le nom par défaut est donné, les options doivent également être données.

source: If none of the options are wanted, use 0 for options.
fr: Si aucune des options n'est désirées, utilisez 0 pour options.

source: Special Windows folders (such as "My Documents") can be set as root by using the right CLSID detailed in the Appendix.
fr: Les dossiers spéciaux de Windows (tels que "Mes Documents") peuvent parfois être définis comme répertoire initial, Consultez l'Appendix.

source: @WorkingDir is changed on successful return.
fr: @WorkingDir est modifié sur un retour réussi.

source: Create a constant variable in Local scope of the message to display in FileOpenDialog.
fr: Crée une constante de portée locale avec le message à afficher dans FileOpenDialog.

source: Display an open dialog to select a list of file(s).
fr: Ouvre une boîte de dialogue pour sélectionner une liste de fichier(s).

source: Display the error message.
fr: Affiche le message d'erreur.
